import React from "react";
import style from "./MyRecips.module.css";
import MealCard from "../mealCard/mealCard";
import noMeals from "../../assets/nomeals.gif";
export default function MyRecips() {
  const meals = [
    // {
    //   index: 488,
    //   name: "النجريسكو",
    //   time: "غداء",
    //   ingredients:
    //     "400 صدور دجاج، مخلية ومقطعة إلى قطع صغيرة الحجم.  ,   الملح والفلفل حسب الذوق.  ,   2 فص الثوم مفروم.  ,  80 جم زيت زيتون.  ,   70 جم دقيق.  ,   400 مل لبن كامل الدسم.  ,   400 جم مكرونة بينا.  ,   100 جم جبنة شيدر مبشورة.  ,   50 جم جبنة بارميزان مبشورة.      ",
    //   prep: "      اطهى المكرونة وفقا للتعليمات على الكيس، ثم صفيها وضعيها جانباً.  ,   فى هذه الأثناء فى حلة صلصة كبيرة، اضيفى زيت الزيتون، والدجاج، الثوم، والملح والفلفل، ثم حمريها على نار متوسطة إلى منخفضة، واطهى الدجاج مع التحريك المستمر، حتى لم يعد لونه وردى اضيفى الدقيق وقلبيه حتى يمتص كل السائل ويصبح كالمعجون الذى يغطى الدجاج.  ,   ببطء اضيفى اللبن مع التحريك المستمر، حتى يكون لديكِ صلصة كريمية خفيفة من البشاميل.  ,   ارفعى الحلة من على النار، اضيفى الجبن الشيدر وقلبيه حتى يتم توزيعه بشكل جيد.  ,   اضيفي المكرونة المطبوخة وقلبيها حتى يتم توزيعها جيداً، صبى الخليط كله فى صينية فرن عميقة، ثم رشى على السطح الجبن البارميزان.  ,   اخبزيها فى الفرن على 210درجة مئوية، حتى يصبح الوجه لونه بنياً ذهبياً، ثم تقدم ساخنة.      ",
    //   img_link: {
    //     url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750274/WannaMeal/recommend/ocrxycya2j0ieo9suqg7.jpg",
    //     id: "WannaMeal/recommend/ocrxycya2j0ieo9suqg7",
    //   },
    //   calories: 1061,
    //   prep_time: 30,
    //   no_of_ppl: 4,
    // },
    // {
    //   index: 152,
    //   name: "الأرز بالزعفران",
    //   time: "غداء",
    //   ingredients:
    //     "  400 جم  أرز بسمتي مغسول.  ,   810 مل  مرق دجاج أو مرق خضار.  ,    150 جم  بصل أصفر مفروم ناعمًا.  ,   1 ملعقة صغيرة  زعفران.  ,  60 مل  ماء مغلي.  ,   2 ملعقة كبيرة زيت زيتون.  ,   1 ملعقة صغيرة  ملح.      ",
    //   prep: "      ضعي الزعفران في وعاء صغير، ثم أضيفي الماء المغلي، وقلبي جيدًا، ثم اتركيه جانبًا لمدة خمس دقائق.  ,   سخني الزيت في قدر كبير على نار متوسطة، ثم أضيفي البصل وقلبيه لمدة ثماني إلى عشر دقائق حتى يتكرمل.  ,   أضيفي الأرز وقلبي لمدة دقيقة، ثم أضيفي خليط الزعفران والمرق والملح، وقلبي جيدًا، واتركيه حتى يغلي.  ,   غطي القدر، واتركيه على نار هادئة مدة 30 دقيقة حتى ينضج.  ,   ضعي الأرز في أطباق التقديم، وقدميه ساخنًا مع الدجاج والسلطات.      ",
    //   img_link: {
    //     url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750275/WannaMeal/recommend/rqyhl3iqkk5fndudnjmu.jpg",
    //     id: "WannaMeal/recommend/rqyhl3iqkk5fndudnjmu",
    //   },
    //   calories: 454.99,
    //   prep_time: 50,
    //   no_of_ppl: 4,
    // },
    // {
    //   index: 154,
    //   name: "الكوارع",
    //   time: "غداء",
    //   ingredients:
    //     " 1500 مل  من الماء المغلي  ,   1000 جم  كوارع مقطعة  ,   بصلة كبيرة مفرومة ناعمًا  ,   بصلة صغيرة مقطعة مكعبات صغيرة  ,  200 جم  فلفل أخضر حار مفروم  ,   4 ثمرات طماطم مقشرة، ومفرومة ناعمًا  ,   6 فصوص ثوم مهروس  ,   2 ملعقة كبيرة  خل أبيض  ,   4 معلقة  كبيرة  زيت  , 1  ملعقة كبيرة  زبدة في درجة حرارة الغرفة  ,  1 ملعقة كبيرة  صلصة طماطم  ,   3 ورقات لورا  ,   عود قرفة  ,   5 حبات حبهان  ,   4 حبات قرنفل  ,  1 ملعقة صغيرة  فلفل أسود حصى  ,   ملح وفلفل أسود      ",
    //   prep: "      انقعي الكوارع في ماء وخل وملح وعصير ليمون لمدة ساعة.  ,   صفي الكوارع من الماء، واغسليها جيدًا تحت الماء الجاري مرتين.  ,   على نار متوسطة، ضعي الكوارع والملح والفلفل الأسود، ثم غطيها بالماء، واتركيها حتى تغلي.  ,   صفي الكوارع من الماء، واتركيها جانبًا.  ,   على نار متوسطة، ضعي الزبدة ونصف كمية الزيت، واتركيهما حتى تذوب الزبدة.  ,   أضيفي الكوارع، وقلبيها لمدة 5 دقائق، ثم أضيفي ورق اللورا والقرفة والحبهان والقرنفل والفلفل الحصى، وقلبي لمدة دقيقة.  ,   أضيفي البصل المفروم، وقلبي لمدة دقيقتين، ثم أضيفي الماء، واتركيه حتى تغلي.  ,   غطي القدر، واتركي الكوارع على نار هادئة جدًّا لمدة ساعة حتى تنضج.  ,   على نار متوسطة، سخني الزيت، ثم أضيفي مكعبات البصل الصغيرة، وقلبيها حتى تذبل ويصفر لونها.  ,   أضيفي الثوم والفلفل الحار، وقلبي لمدة دقيقة، ثم أضيفي الطماطم المفرومة وصلصة الطماطم والملح والفلفل الأسود، وقلبي لمدة دقيقة.  ,   اتركي الصلصة على النار حتى تغلي، ثم غطي القرد واتركيها على نار هادئة جدًّا لمدة 10 دقائق.  ,   أضيفي الخل واتركيها لمدة دقيقة، ثم أضيفي الكوارع، وكوبًا من شوربة الكوارع، واتركيها على نار هادئة لمدة 15 دقيقة، ثم قدميها ساخنة.      ",
    //   img_link: {
    //     url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750275/WannaMeal/recommend/urvgyfbjd3aak0njsl6u.jpg",
    //     id: "WannaMeal/recommend/urvgyfbjd3aak0njsl6u",
    //   },
    //   calories: 150,
    //   prep_time: 105,
    //   no_of_ppl: 6,
    // },
  ];

  return (
    <>
      <div
        className={` my-3 d-flex flex-wrap w-100 justify-content-center justify-content-md-between g-2 align-items-center ${style.recipsContainer} `}
      >
        {meals && meals.length > 0 ? (
          meals.map((meal) => {
            return <MealCard meal={meal} className=" col-12 col-lg-3" />;
          })
        ) : (
          <div className={style.noMealscontainer}>
            <div className={style.imageContainer}>
              <img src={noMeals} alt="" srcset="" />
            </div>
            <h3 className={style.mainTitle}>
              You haven't published any recipe yet.
            </h3>
            <p className={style.secondaryTitle}>
              Post your first recipe and you'll find it here.
            </p>
          </div>
        )}
      </div>
    </>
  );
}
