import React from "react";
import style from "./savedMeals.module.css";
import MealCard from "../mealCard/mealCard";
import noMeals from "../../assets/nosavedmeals.gif";
import { useSelector } from "react-redux";
import { getSavedMeals } from "../../redux/slices/recomendedMealsSlice";
export default function SavedMeals() {
  const savedMeals = useSelector(getSavedMeals);

  const meals = [
    {
      index: 488,
      recipeName: "النجريسكو",
      time: "غداء",
      ingredients:
        "400 صدور دجاج، مخلية ومقطعة إلى قطع صغيرة الحجم.  ,   الملح والفلفل حسب الذوق.  ,   2 فص الثوم مفروم.  ,  80 جم زيت زيتون.  ,   70 جم دقيق.  ,   400 مل لبن كامل الدسم.  ,   400 جم مكرونة بينا.  ,   100 جم جبنة شيدر مبشورة.  ,   50 جم جبنة بارميزان مبشورة.      ",
      prep: "      اطهى المكرونة وفقا للتعليمات على الكيس، ثم صفيها وضعيها جانباً.  ,   فى هذه الأثناء فى حلة صلصة كبيرة، اضيفى زيت الزيتون، والدجاج، الثوم، والملح والفلفل، ثم حمريها على نار متوسطة إلى منخفضة، واطهى الدجاج مع التحريك المستمر، حتى لم يعد لونه وردى اضيفى الدقيق وقلبيه حتى يمتص كل السائل ويصبح كالمعجون الذى يغطى الدجاج.  ,   ببطء اضيفى اللبن مع التحريك المستمر، حتى يكون لديكِ صلصة كريمية خفيفة من البشاميل.  ,   ارفعى الحلة من على النار، اضيفى الجبن الشيدر وقلبيه حتى يتم توزيعه بشكل جيد.  ,   اضيفي المكرونة المطبوخة وقلبيها حتى يتم توزيعها جيداً، صبى الخليط كله فى صينية فرن عميقة، ثم رشى على السطح الجبن البارميزان.  ,   اخبزيها فى الفرن على 210درجة مئوية، حتى يصبح الوجه لونه بنياً ذهبياً، ثم تقدم ساخنة.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750274/WannaMeal/recommend/ocrxycya2j0ieo9suqg7.jpg",
        id: "WannaMeal/recommend/ocrxycya2j0ieo9suqg7",
      },
      calories: 1061,
      prep_time: 30,
      no_of_ppl: 4,
    },
    {
      index: 152,
      recipeName: "الأرز بالزعفران",
      time: "غداء",
      ingredients:
        "  400 جم  أرز بسمتي مغسول.  ,   810 مل  مرق دجاج أو مرق خضار.  ,    150 جم  بصل أصفر مفروم ناعمًا.  ,   1 ملعقة صغيرة  زعفران.  ,  60 مل  ماء مغلي.  ,   2 ملعقة كبيرة زيت زيتون.  ,   1 ملعقة صغيرة  ملح.      ",
      prep: "      ضعي الزعفران في وعاء صغير، ثم أضيفي الماء المغلي، وقلبي جيدًا، ثم اتركيه جانبًا لمدة خمس دقائق.  ,   سخني الزيت في قدر كبير على نار متوسطة، ثم أضيفي البصل وقلبيه لمدة ثماني إلى عشر دقائق حتى يتكرمل.  ,   أضيفي الأرز وقلبي لمدة دقيقة، ثم أضيفي خليط الزعفران والمرق والملح، وقلبي جيدًا، واتركيه حتى يغلي.  ,   غطي القدر، واتركيه على نار هادئة مدة 30 دقيقة حتى ينضج.  ,   ضعي الأرز في أطباق التقديم، وقدميه ساخنًا مع الدجاج والسلطات.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750275/WannaMeal/recommend/rqyhl3iqkk5fndudnjmu.jpg",
        id: "WannaMeal/recommend/rqyhl3iqkk5fndudnjmu",
      },
      calories: 454.99,
      prep_time: 50,
      no_of_ppl: 4,
    },
    {
      index: 154,
      recipeName: "الكوارع",
      time: "غداء",
      ingredients:
        " 1500 مل  من الماء المغلي  ,   1000 جم  كوارع مقطعة  ,   بصلة كبيرة مفرومة ناعمًا  ,   بصلة صغيرة مقطعة مكعبات صغيرة  ,  200 جم  فلفل أخضر حار مفروم  ,   4 ثمرات طماطم مقشرة، ومفرومة ناعمًا  ,   6 فصوص ثوم مهروس  ,   2 ملعقة كبيرة  خل أبيض  ,   4 معلقة  كبيرة  زيت  , 1  ملعقة كبيرة  زبدة في درجة حرارة الغرفة  ,  1 ملعقة كبيرة  صلصة طماطم  ,   3 ورقات لورا  ,   عود قرفة  ,   5 حبات حبهان  ,   4 حبات قرنفل  ,  1 ملعقة صغيرة  فلفل أسود حصى  ,   ملح وفلفل أسود      ",
      prep: "      انقعي الكوارع في ماء وخل وملح وعصير ليمون لمدة ساعة.  ,   صفي الكوارع من الماء، واغسليها جيدًا تحت الماء الجاري مرتين.  ,   على نار متوسطة، ضعي الكوارع والملح والفلفل الأسود، ثم غطيها بالماء، واتركيها حتى تغلي.  ,   صفي الكوارع من الماء، واتركيها جانبًا.  ,   على نار متوسطة، ضعي الزبدة ونصف كمية الزيت، واتركيهما حتى تذوب الزبدة.  ,   أضيفي الكوارع، وقلبيها لمدة 5 دقائق، ثم أضيفي ورق اللورا والقرفة والحبهان والقرنفل والفلفل الحصى، وقلبي لمدة دقيقة.  ,   أضيفي البصل المفروم، وقلبي لمدة دقيقتين، ثم أضيفي الماء، واتركيه حتى تغلي.  ,   غطي القدر، واتركي الكوارع على نار هادئة جدًّا لمدة ساعة حتى تنضج.  ,   على نار متوسطة، سخني الزيت، ثم أضيفي مكعبات البصل الصغيرة، وقلبيها حتى تذبل ويصفر لونها.  ,   أضيفي الثوم والفلفل الحار، وقلبي لمدة دقيقة، ثم أضيفي الطماطم المفرومة وصلصة الطماطم والملح والفلفل الأسود، وقلبي لمدة دقيقة.  ,   اتركي الصلصة على النار حتى تغلي، ثم غطي القرد واتركيها على نار هادئة جدًّا لمدة 10 دقائق.  ,   أضيفي الخل واتركيها لمدة دقيقة، ثم أضيفي الكوارع، وكوبًا من شوربة الكوارع، واتركيها على نار هادئة لمدة 15 دقيقة، ثم قدميها ساخنة.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750275/WannaMeal/recommend/urvgyfbjd3aak0njsl6u.jpg",
        id: "WannaMeal/recommend/urvgyfbjd3aak0njsl6u",
      },
      calories: 150,
      prep_time: 105,
      no_of_ppl: 6,
    },
    {
      index: 155,
      recipeName: "فتة الكوارع",
      time: "غداء",
      ingredients:
        "1000 جم  كوارع.  ,  300 جم أرز مصري.  ,  300 مل  عصير طماطم طازج.  ,  300 جم خبز بلدي مقطع مكعبات.  ,   بصلة متوسطة مفرومة فرمًا ناعمًا.  ,   3 معلقة  كبيرة زبد.  ,   6 معلقة  كبيرة زيت.  ,   3 معلقة  كبيرة ثوم.  ,   60 مل خل.  ,   2 ورق لورا.  ,   5 حبات حبهان.  ,   ملح وفلفل أسود.      ",
      prep: "      سخني الفرن عند درجة حرارة 200.  ,   في وعاء كبير ضعي الخبز، و4 ملاعق من الزيت، وملعقة من الثوم، وقلبي جيدًا.  ,   ضعي الخبز في صينية عليها ورق زبد، ثم ضعيها في الفرن لمدة 25 دقيقة، حتى يتحمص.  ,   اغسلي الكوارع جيدًا.  ,   على نار متوسطة ضعي كمية كبيرة من الماء، واتركيه حتى يغلي.  ,   أضيفي الكوارع والملح والفلفل الأسود واللورا والحبهان والبصل المفروم، واتركيه لمدة 60 دقيقة حتى ينضج.  ,   صفي الكوارع من الشوربة، ثم ضعيها في صينية، وضعيها في الفرن عند درجة حرارة 200 لمدة 30 دقيقة.  ,   على نار متوسطة، ضعي الزيت و2 ملعقة من الزبد، وقلبي حتى يذوب الزبد.  ,   أضيفي  الأرز والملح، وقلبي لمدة 5 دقائق، ثم أضيفي 2 كوب من شوربة الكوارع، واتركيها حتى تغلي.  ,   غطي القدر، واتركي الأرز على نار هادئة حتى ينضج.  ,   على نار متوسطة، ذوّبي باقي الزبد، ثم أضيفي الثوم وقلبي لمدة دقيقة.  ,   أضيفي الخل واتركيه يغلي، ثم أضيفي عصير الطماطم، واتركيه يغلي.  ,   غطي القدر، واتركي الصلصة على نار هادئة لمدة 20 دقيقة.  ,   في صينية بايركس، ضعي الخبز، ثم صبي عليه قليلًا من شوربة الكوارع.  ,   ضعي الأرز فوق الخبز، ثم وزعي الصلصة على الأرز، ثم ضعي قطع الكوارع، وقدميها ساخنة.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750276/WannaMeal/recommend/jcwi0v1lfz1jnnww7ucp.jpg",
        id: "WannaMeal/recommend/jcwi0v1lfz1jnnww7ucp",
      },
      calories: 1023,
      prep_time: 120,
      no_of_ppl: 4,
    },
    {
      index: 156,
      recipeName: "الكوارع بالثوم",
      time: "غداء",
      ingredients:
        "2000 جم كوارع.  ,   2 ملعقة كبيرة ثوم مفروم.  ,  1 ملعقة كبيرة سمن.  ,  40 مل خل أبيض.  ,   2 ورقة لورا.  ,   5 حبات حبهان  ,   ملح وفلفل أسود.      ",
      prep: "      سخني الفرن عند درجة حرارة 250، ثم ضعي فيه الطاجن ليسخن.  ,   اغسلي الكوارع جيدًا.  ,   على نار متوسطة، ضعي كمية كبيرة من الماء، واتركيه حتى يغلي.  ,   أضيفي الكوارع والملح والفلفل الأسود والحبهان واللورا، واتركيها لمدة 60 دقيقة.  ,   على نار متوسطة، ذوبي السمن، ثم أضيفي الثوم وقلبي لمدة دقيقة.  ,   أضيفي الخل واتركيه حتى يغلي، ثم الكوارع وقلبي لمدة 5 دقائق.  ,   ضعي الكوارع في الطاجن مع خليط الثوم والخل، ثم ضعيها في الفرن لمدة 30 دقيقة.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750276/WannaMeal/recommend/uq69ydcpueyslau3zpeu.jpg",
        id: "WannaMeal/recommend/uq69ydcpueyslau3zpeu",
      },
      calories: 353,
      prep_time: 120,
      no_of_ppl: 6,
    },
    {
      index: 157,
      recipeName: "ورق العنب بالكوارع",
      time: "غداء",
      ingredients:
        "      كارع بقري كبير.   ,   بصلة كبيرة مفرومة ناعمًا.   , 1  ملعقة كبيرة  ثوم مهروس.  , 1 ملعقة كبيرة  زيت.  ,   ساق كرفس كبير مفروم.  ,   ملح وفلفل أسود.  ,   2 ورقة غار  لورا .  ,   ماء مغلي.      ",
      prep: "      اغسلي الكارع تحت الماء الجاري، ثم انقعيه في محلول ملحي مع عصير ليمون وخل أبيض وبيكربونات صودا، واتركيه ساعة.  ,   اغسلي الكارع مرات عدة تحت الماء الجاري، ثم قطعيه إلى قطع متوسطة الحجم.  ,   ضعي كمية من الماء في قدر كبيرة على نار متوسطة، واتركيه حتى يغلي.  ,   أضيفي الكوارع، واتركيها تغلي مع الماء 15 دقيقة، ثم صفيها من الماء، واغسليها مرةً أخرى تحت الماء الجاري.  ,   سخني الزيت في قدر كبيرة على نار متوسطة، ثم أضيفي الكوارع، وقلبيها حتى تُصبح ذهبية اللون.  ,   أضيفي البصل والكرفس والثوم وورق الغار، وقلبي دقيقتين.  ,   أضيفي الملح والفلفل الأسود والماء المغلي، واتركيه حتى يغلي مع الكوارع.  ,   غطي القدر، واتركيها على نار هادئة من ساعتين إلى ثلاث ساعات، حتى تنضج الكوارع.  ,   صفي الكوارع من الشوربة، وتخلصي من العظم، واتركيها جانبًا.  ,   ضعي الأرز والبقدونس والكزبرة والشبت والبصل والطماطم والزيت وصلصة الطماطم والثوم والبهارات السبعة والكزبرة والكمون والسكر والقرفة ومكعب المرق والملح والفلفل الأسود في وعاء كبير، وقلبي جيدًا حتى تمتزج المكونات.  ,   افردي الورقة، ثم ضعي ملعقة من خليط الأرز على طرف الورقة، ثم اثني الطرفين إلى الداخل، ولفي الورقة كالرول.  ,   رصي شرائح البطاطس في قدر كبيرة، ثم وزعي الكوارع المخلية من العظم فوق البطاطس، ثم رصي ورق العنب فوق الكوارع.  ,   ضعي طبقًا فوق ورق العنب، حتى لا ينفتح الورق في أثناء الطهي.  ,   أضيفي عصير الليمون إلى كوبين من مرق الكوارع، وقلبي جيدًا.  ,   صبي المرق فوق ورق العنب حتى يُغطيه، ثم ضعيه على نار متوسطة، واتركيه حتى يغلي.  ,   غطي القدر، واتركيها على نار هادئة جدًا ساعة، حتى ينضج ورق العنب.  ,   اقلبي ورق العنب في طبق التقديم، ثم قدميه ساخنًا.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750277/WannaMeal/recommend/pfr96rh0q8gq8o8iaylx.jpg",
        id: "WannaMeal/recommend/pfr96rh0q8gq8o8iaylx",
      },
      calories: 781.35,
      prep_time: 120,
      no_of_ppl: 6,
    },
    {
      index: 158,
      recipeName: "الكرعين بالحمص",
      time: "غداء",
      ingredients:
        " 250 جم  حمص منقوع ومصفى.  ,   120  جم  بقدونس صغيرة مفرومة.  ,  200 جم  فلفل أحمر حار.  ,   1500 جم  كرعين  كوارع  مقطعة شرائح سميكة.  ,   4 بصلات متوسطة الحجم مقطعة شرائح.  ,   2 ساق كراث مقطع شرائح.  ,   6 فصوص ثوم.  ,   2 ملعقة كبيرة  زيت زيتون.  ,   2 عود قرفة.  , 1  ملعقة صغيرة   كركم.  ,  1 ملعقة صغيرة   كزبرة جافة مطحونة.  ,   1 ملعقة صغيرة  كمون مطحون.  ,   1 ملعقة صغيرة   زنجبيل.  , 1  ملعقة صغيرة  بابريكا.  ,   ملح وفلفل أسود.      ",
      prep: "      اغسلي الكوارع تحت الماء الجاري، ثم انقعيه في محلول ملحي مع عصير ليمون وخل أبيض وبيكربونات صودا، واتركيه لمدة ساعة، ثم اغسليه عدة مرات تحت الماء الجاري.  ,   ضعي كمية من الماء في قدر كبير على نار متوسطة، واتركيه حتى يغلي.  ,   أضيفي الكوارع، واتركيها تغلي مع الماء لمدة 15 دقيقة، ثم صفيها، واغسليها مرةً أخرى تحت الماء الجاري.  ,   ضعي الكوارع في قدر كبير على نار متوسطة، ثم أضيفي الزيت والقرفة والكركم والكزبرة والكمون والزنجبيل والبابريكا والملح والفلفل الأسود والكراث والثوم والبصل، ثم اغمريها بالماء المغلي.  ,   اتركي الماء يغلي مع الكوارع والبهارات، ثم غطي القدر، واتركيه على نار هادئة لمدة ساعتين حتى تنضج الكوارع.  ,   أضيفي الحمص والفلفل الحار ونصف كمية البقدونس وكوبين من الماء المغلي، وقلبي جيدًا.  ,   غطي القدر واتركيه على نار هادئة لمدة ساعة حتى ينضج الحمص.  ,   ارفعي الكوارع عن النار، ثم أضيفي البقدونس وقلبي جيدًا.  ,   ضعي الكرعين بالحمص في طبق التقديم، وقدميها ساخنة مع الكسكسي أو الأرز.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750277/WannaMeal/recommend/e7admkqjphqob7nxmjo0.jpg",
        id: "WannaMeal/recommend/e7admkqjphqob7nxmjo0",
      },
      calories: 1291.26,
      prep_time: 180,
      no_of_ppl: 6,
    },
    {
      index: 159,
      recipeName: "المندي الأردني",
      time: "غداء",
      ingredients:
        "  400 جم  أرز بسمتي.  ,   875 مل  ماء مغلي.  , 1800 جم  دجاج مقطعة ثماني قطع ومغسولة جيدًا.  ,   2 بصلة كبيرة مقطعتان شرائح متوسطة.  , 200 جم  طماطم مقشرة ومقطعة مكعبات صغيرة.  ,   2 فص ثوم.  ,   3 معلقة  كبيرة   زبادي.  ,   3 معلقة  كبيرة    ماء.  ,   4 معلقة  كبيرة    زيت.  ,   1 ملعقة صغيرة    بهارات مشكلة.  ,   1 ملعقة صغيرة   كمون.  ,   1 ملعقة صغيرة   كركم.  ,   1 ملعقة صغيرة   بودرة زعفران.  ,   عود قرفة.  ,   2 ورقة غار  لورا .  ,  1 ملعقة صغيرة  عصير ليمون.  , 1 ملعقة صغيرة خيوط زعفران ,  2 ملعقة كبيرة  ماء ورد.  ,   مكعب مرق دجاج مطحون.  ,   ملح وفلفل أسود.      ",
      prep: "      ضعي الزبادي وملعقتين من الزيت والبهارات والكركم وبودرة الزعفران وعصير الليمون والملح والفلفل الأسود والماء، وقلبي جيدًا حتى تمتزج المكونات.  ,   أضيفي الدجاج، وقلبي جيدًا، وغطي الوعاء بورق نايلون، ثم ضعيه في الثلاجة مدة ساعة.  ,   سخني الفرن عند درجة حرارة 200 درجة مئوية.  ,   سخني باقي الزيت في صينية ألومنيوم أو تيفال على نار متوسطة، ثم أضيفي البصل وقلبي من ثلاث إلى أربع دقائق حتى يذبل.  ,   أضيفي الثوم، وقلبي 30 ثانية، ثم أضيفي الطماطم وعود القرفة وورق الغار والملح والفلفل الأسود، وقلبي جيدًا.  ,   أضيفي مكعب المرق والأرز، وقلبي جيدًا، ثم أضيفي الماء المغلي، واتركي الخليط حتى يغلي على النار.  ,   غطي الصينية بورق قصدير (فويل) جيدًا، ثم اصنعي به عدة فتحات باستخدام سيخ خشبي أو شوكة.  ,   رصي الدجاج فوق الفويل، ثم غطيه بورق فويل آخر جيدًا.  ,   ضعي الصينية في الفرن مدة 90 دقيقة.  ,   صفي خيوط الزعفران من ماء الورد، واحتفظي بالماء جانبًا.  ,   بعد نضج الدجاج والأرز، انقلي الدجاج في صينية، واتركيه مكشوفًا، ثم ضعيه في الفرن 15 دقيقة حتى يحمر الوجه.  ,   أخرجي الأرز، ووزعي ماء الورد بالزعفران على الوجه، ثم ضعي ورقة قصدير في منتصف الأرز، وضعي بها الفحم المشتعل، ثم أضيفي قطرات الزيت إلى الفحم.  ,   غطي الصينية بسرعة بورقة قصدير جديدة، واتركيها جانبًا من ثلاث إلى أربع دقائق.  ,   ارفعي الفحم، وقلبي الأرز، ثم ضعيه في طبق التقديم.  ,   وزعي الدجاج على الوجه، وقدميه ساخنًا مع سلطة الزبادي بالخيار.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750278/WannaMeal/recommend/hy5aq4dgm3djyfpwvakv.jpg",
        id: "WannaMeal/recommend/hy5aq4dgm3djyfpwvakv",
      },
      calories: 1314.07,
      prep_time: 120,
      no_of_ppl: 4,
    },
    {
      index: 160,
      recipeName: "مندي دجاج",
      time: "غداء",
      ingredients:
        "1000 جم أرز بسمتي  ,  1  ملعقة زعفران  ,  1 ملعقة قرفة  ,   ورق الغار  اللاوري   ,   حبهان  هيل  حسب الرغبة  ,   ملح   ,   فلفل أسود  ,   بهارات مشكلة  ,   دجاجة  ,   بصل مفروم  ,   مكسرات وزبيب وصنوبر  يتم تشويحها       ",
      prep: "      اغسلي الأرز وانقعيه لنصف ساعة في ماء دافئ.  ,   قطعي الدجاجة إلى ثمانية قطع  ,   شوحي البصل في قدر كبير وعميق إلى أن يصبح لونها ذهبيًا داكنًا  ,   أضيفي الدجاج وقلبيه حتى يصبح ذهبيًا ويبدأ في إنزال دهونه  ,   ضعي القرفة والغار والحبهان والتوابل  ,   ضعي بعض الماء واتركيه على نار هادئة لمدة نصف ساعة حتى تشعري أنه قد نضج تمامًا  ,   في كوب صغير ضعي بعض الماء الدافئ وأذيبي الزعفران.  ,   أضيفي قليل جدًا من الكمية على الدجاج وقلبي.  ,   ارفعيه من النار وضعيه في صينية ولفيه بورق الألومنيوم وضعيه في الفرن.  ,   في قدر آخر، ضعي 6 أكواب من الماء مع قطعتين من مكعبات الدجاج، أو 6 أكواب من المرق (يحتاج البسمتي إلى ماء أكثر من الأرز الأبيض).  ,    تبلي الماء بما تريدين من توابل ويمكنك وضع ليمون مجفف معه  ,    ضعي ملعقة من الزعفران على الماء  ,    بعد الغليان أضيفي الأرز بعد تصفيته، ثم بعد الغليان اتركيه على نار هادئة  ,   قرب النضح ضعي بقية كمية الزعفران على جانب واحد من القدر، وبذلك يكون جميع الأرز أصفر عدا بعض الأرز يصبح برتقالي اللون  ,    قبل التقديم قلبي الأرز جيدًا لتتناغم الألوان  ,    ضعي الأرز والدجاج عليه وزينيه بالمكسرات.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750279/WannaMeal/recommend/rvkifnr62m7xeoi0qoxv.jpg",
        id: "WannaMeal/recommend/rvkifnr62m7xeoi0qoxv",
      },
      calories: 460,
      prep_time: 90,
      no_of_ppl: 6,
    },
    {
      index: 161,
      recipeName: "مندي اللحم",
      time: "غداء",
      ingredients:
        "1000 جم  لحم   ,   4حبات طماطم  ,   4 حبات بصل يقطع شرائح  ,   فلفل أسود نصف ملعقة  ,   ملح وبهارات حسب الرغبه  ,   فنجان زيت  ,   حبهان  ,   زعتر  اختياري   ,   فحم      ",
      prep: "      اغسلي اللحم وقطعيه إلى قطع كبيرة ثم صفيه من الماء تماماً  ,   ضعي اللحم في القدر وارفعيه على نار هادئة حتى ينشف ماتم به من الماء مع ملاحظة تغطية القدر  ,   اضيفي إليه البصلة بعد تقشيرها و8 كأسات ماء ساخن واتركيه على النار لمدة نصف ساعة ثم أضيفي الحبهان والملح اللازم واتركيه على النار حتى يكمل نضجه  ,   اغسلي الأرز واتركيه حتى ينقع لمدة نصف ساعة  ,   عندما ينضج اللحم انشليه من المرق وصفي المرق بصافية سلك وأعيديه إلى القدر  ,   اخلطي الفلفل الأسود مع الزعفران وملعقة طعام زيت وقليل من الملح وتبلي بها اللحم ولفيه في ورق فويل وأدخليه الفرن لمدة ربع ساعة حتى يتحمر  ,   صفي الأرز من ماء النقع وضعيه في مرق اللحم المغلي سابقاً واتركيه حتى ينضج ويشرب ماؤه  ,   اضيفي الزعفران إلي اﻷرز  ,   اشعلي قطعة الفحم حتى تصبح جمراً  ,   اعملي حفرة في الأرز وخذي قطعة من الفويل لتضعي بها الفحم المشتعل وصبي على الفحم الزيت وغطي القدر بسرعة  ,   اتركي القدر على النار لمدة عشر دقائق حتى يستوي الأرز  ,   اغرفي الأرز في صحن التقديم وضعي اللحم عليه و قدميه بالهناء و الشفاء.      ",
      image: {
        url: "https://res.cloudinary.com/dz5dpvxg7/image/upload/v1718750279/WannaMeal/recommend/wsgpacbirsqlcberazqo.jpg",
        id: "WannaMeal/recommend/wsgpacbirsqlcberazqo",
      },
      calories: 458,
      prep_time: 50,
      no_of_ppl: 8,
    },
  ];

  return (
    <>
      <div
        className={` my-3 d-flex flex-wrap w-100 justify-content-center justify-content-md-between g-2 align-items-center ${style.recipsContainer} `}
      >
        {meals && meals.length > 0 ? (
          meals.map((meal) => {
            return <MealCard meal={meal} className=" col-12 col-lg-3" />;
          })
        ) : (
          <div className={style.noMealscontainer}>
            <div className={style.imageContainer}>
              <img src={noMeals} alt="" srcset="" />
            </div>
            <h3 className={style.mainTitle}>There are no recipes saved yet.</h3>
            <p className={style.secondaryTitle}>
              Save the recipes you like to try later and you will find them
              saved here.{" "}
            </p>
          </div>
        )}
      </div>
    </>
  );
}
